Catalogs/Сотрудники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>Сотрудники</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Должности</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Должность</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Должности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Основная</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Сотрудники/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура УстановитьОсновной(Команда)
	ТекущиеДанные = Элементы.Должности.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат
	КонецЕсли;
	Для Каждого Стр ИЗ Объект.Должности Цикл
		Стр.Основная = ТекущиеДанные.Должность = Стр.Должность;
	КонецЦикла;
	Объект.Должность = ТекущиеДанные.Должность;
	Объект.Подразделение = ТекущиеДанные.Подразделение;
	ПодразделениеПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПодразделениеПриИзмененииНаСервере()
	Объект.Родитель = Объект.Подразделение.Руководитель;
КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеПриИзменении(Элемент)
	ПодразделениеПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ТекущийСотрудник = Неопределено;
	Если не Параметры.Ключ.Пустая() Тогда
		ТекущийСотрудник = Объект.Ссылка;
	КонецЕсли;
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Договоры, "ТекущийСотрудник", ТекущийСотрудник, Истина);		
	НаПериод = ТекущаяДатаСеанса();
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Задачи, "ДатаНачала", НаПериод, ВидСравненияКомпоновкиДанных.МеньшеИлиРавно);		
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Задачи, "ДатаОкончания", НаПериод, ВидСравненияКомпоновкиДанных.БольшеИлиРавно);		
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Задачи, "Администратор", ТекущийСотрудник);	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Договоры, "ТекущийСотрудник", Объект.Ссылка, Истина);		
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Задачи, "Администратор", Объект.Ссылка);	
КонецПроцедуры

&НаКлиенте
Процедура НаПериодПриИзменении(Элемент)
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Задачи, "ДатаНачала", НаПериод, ВидСравненияКомпоновкиДанных.МеньшеИлиРавно);		
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Задачи, "ДатаОкончания", НаПериод, ВидСравненияКомпоновкиДанных.БольшеИлиРавно);		
КонецПроцедуры

&НаКлиенте
Процедура ЗадачиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ТекущиеДанные = Элементы.Задачи.ТекущаяСтрока;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если ТипЗнч(ТекущиеДанные) = Тип("КлючСтрокиДинамическогоСписка") Тогда
		Если ТипЗнч(ТекущиеДанные.Ссылка) = Тип("СправочникСсылка.Задачи") Тогда
			ПоказатьЗначение(,ТекущиеДанные.Ссылка);
		Иначе
			ПоказатьЗначение(,ТекущиеДанные.Владелец);
		КонецЕсли;
	ИначеЕсли ТипЗнч(ТекущиеДанные) = Тип("СтрокаГруппировкиДинамическогоСписка") Тогда
		ПоказатьЗначение(,ТекущиеДанные.Ключ);
	КонецЕсли;
КонецПроцедуры
